<a href="https://colab.research.google.com/github/NayeonKeum/ToyProjects/blob/master/Drop_out_of_college_VS_set_up_a_cafe%3F/ml_inheon.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [24]:
import pandas as pd
import numpy as np
import re

# 그래프에서 한글표현을 위해 폰트를 설치합니다.
%config InlineBackend.figure_format = 'retina'

!apt -qq -y install fonts-nanum > /dev/null
import matplotlib.font_manager as fm
fontpath = '/usr/share/fonts/truetype/nanum/NanumBarunGothic.ttf'
font = fm.FontProperties(fname=fontpath, size=9)

from plotnine import *
import plotnine

# 기본 글꼴 변경
import matplotlib as mpl
mpl.font_manager._rebuild()
mpl.pyplot.rc('font', family='NanumBarunGothic')

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

In [16]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC

import numpy as np

In [17]:
import pandas as pd

In [152]:
test=pd.read_csv("/content/drive/My Drive/Colab Notebooks/data/test_inheo.csv")
train_data=pd.read_csv("/content/drive/My Drive/Colab Notebooks/data/train_data_inheo.csv")
train=pd.read_csv("/content/drive/My Drive/Colab Notebooks/data/train_inheo.csv")

In [153]:
train=train.dropna(axis=0)
test=test.dropna(axis=0)
train_data=train_data.dropna(axis=0)
#아님 train_data=train_data.drop(['사업장명'], axis=1)

In [154]:
#일단....ㅜㅜㅜ
train_data=train_data.drop(['인허가분기'], axis=1)

In [155]:
target=train['영업상태코드']

In [81]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 29161 entries, 0 to 33442
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  29161 non-null  int64
 1   년도          29161 non-null  float64
 2   영업상태코드      29161 non-null  int64
 3   규모분기        29161 non-null  int64
 4   인허가분기       29161 non-null  object
 5   폐업분기        29161 non-null  int64
 6   총층수         29161 non-null  int64
 7   영업기간분기      29161 non-null  float64
 8   층_01        29161 non-null  int64
 9   구_1_25      29161 non-null  float64
dtypes: float64(3), int64(6), object(1)
memory usage: 2.4+ MB

In [82]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 29161 entries, 0 to 33442
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  29161 non-null  int64
 1   년도          29161 non-null  float64
 2   규모분기        29161 non-null  int64
 3   폐업분기        29161 non-null  int64
 4   총층수         29161 non-null  int64
 5   영업기간분기      29161 non-null  float64
 6   층_01        29161 non-null  int64
 7   구_1_25      29161 non-null  float64
dtypes: float64(3), int64(5)
memory usage: 2.0 MB

In [58]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10764 entries, 0 to 14330
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10764 non-null  int64
 1   년도          10764 non-null  float64
 2   영업상태코드      10764 non-null  int64
 3   사업장명        10764 non-null  object
 4   규모분기        10764 non-null  int64
 5   인허가분기       10764 non-null  int64
 6   폐업분기        10764 non-null  int64
 7   총층수         10764 non-null  int64
 8   영업기간분기      10764 non-null  float64
 9   층_01        10764 non-null  int64
 10  구_1_25      10764 non-null  float64
dtypes: float64(3), int64(7), object(1)
memory usage: 1009.1+ KB

In [100]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10764 entries, 0 to 14330
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10764 non-null  int64
 1   년도          10764 non-null  float64
 2   영업상태코드      10764 non-null  int64
 3   규모분기        10764 non-null  int64
 4   인허가분기       10764 non-null  int64
 5   폐업분기        10764 non-null  int64
 6   총층수         10764 non-null  int64
 7   영업기간분기      10764 non-null  float64
 8   층_01        10764 non-null  int64
 9   구_1_25      10764 non-null  float64
dtypes: float64(3), int64(7)
memory usage: 925.0 KB

In [59]:
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
k_fold=KFold(n_splits=10, shuffle=True, random_state=0)

In [91]:
#kNN
clf=KNeighborsClassifier(n_neighbors=5)#13하니까 평균 79.73,
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.82996229 0.83641975 0.82647462 0.83847737 0.83367627 0.82921811
 0.83607682 0.84053498 0.83676269 0.83641975]

In [92]:
round(np.mean(score)*100,2)

83.44

In [86]:
#decision tree
clf=DecisionTreeClassifier()
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.95097703 0.95336077 0.95919067 0.95507545 0.95061728 0.94718793
 0.95507545 0.95987654 0.96296296 0.95541838]

In [87]:
round(np.mean(score)*100,2)

95.5

In [89]:
#random forest
clf=RandomForestClassifier(n_estimators=13)
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.95817621 0.96090535 0.96193416 0.96124829 0.95473251 0.95576132
 0.96021948 0.968107   0.96467764 0.96056241]

In [90]:
round(np.mean(score)*100,2)

96.06

In [95]:
#naive bayes
clf=GaussianNB()
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.8892698  0.89300412 0.8861454  0.89677641 0.8899177  0.88203018
 0.88957476 0.90432099 0.90466392 0.89300412]

In [96]:
round(np.mean(score)*100,2)

89.29

In [97]:
#svm
clf=SVC()
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.61535824 0.62654321 0.61796982 0.62722908 0.61042524 0.60082305
 0.61625514 0.59739369 0.62139918 0.61899863]

In [98]:
round(np.mean(score)*100,2)

61.52

In [158]:
#test!!-random forest
clf=RandomForestClassifier(n_estimators=13)
clf.fit(train_data,target)
test_data=test.drop(['사업장명','인허가분기','영업상태코드'], axis=1).copy()
prediction=clf.predict(test_data)

In [159]:
submission=pd.DataFrame({'사업장명':test['사업장명'],"Survived":prediction})
submission.to_csv('/content/drive/My Drive/Colab Notebooks/data/submission_inheo.csv',index=False)

In [160]:
submission=pd.read_csv('/content/drive/My Drive/Colab Notebooks/data/submission_inheo.csv')
submission.head()

  사업장명  Survived
0    옥         2
1   미성         2
2   타임         2
3   옥수         2
4   한성         2

In [161]:
submission.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10764 entries, 0 to 10763
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   사업장명      10764 non-null  object
 1   Survived  10764 non-null  int64
dtypes: int64(1), object(1)
memory usage: 168.3+ KB

In [162]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10764 entries, 0 to 14330
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10764 non-null  int64
 1   년도          10764 non-null  float64
 2   영업상태코드      10764 non-null  int64
 3   사업장명        10764 non-null  object
 4   규모분기        10764 non-null  int64
 5   인허가분기       10764 non-null  int64
 6   폐업분기        10764 non-null  int64
 7   총층수         10764 non-null  int64
 8   영업기간분기      10764 non-null  float64
 9   층_01        10764 non-null  int64
 10  구_1_25      10764 non-null  float64
dtypes: float64(3), int64(7), object(1)
memory usage: 1009.1+ KB

In [170]:
sub=pd.DataFrame(submission['Survived'])
testy=pd.DataFrame(test['영업상태코드'])

In [171]:
'''
wrong=0
right=0
for i in range(1,10764):
  if sub[i]==testy[i]:
    right=right+1
  else:
    wrong=wrong+1
print("Your score is : ",right/(right+wrong))
'''
sub.info()
sub

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10764 entries, 0 to 10763
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  10764 non-null  int64
dtypes: int64(1)
memory usage: 84.2 KB

       Survived
0             2
1             2
2             2
3             2
4             2
...         ...
10759         1
10760         1
10761         1
10762         1
10763         1

[10764 rows x 1 columns]

In [172]:
testy=testy[:10764]
testy=testy.reset_index(drop=True)
testy

       영업상태코드
0           2
1           2
2           2
3           2
4           2
...       ...
10759       1
10760       1
10761       2
10762       1
10763       1

[10764 rows x 1 columns]

In [185]:
df=pd.concat([sub, testy],axis=1)
df

       Survived  영업상태코드
0             2       2
1             2       2
2             2       2
3             2       2
4             2       2
...         ...     ...
10759         1       1
10760         1       1
10761         1       2
10762         1       1
10763         1       1

[10764 rows x 2 columns]

In [186]:
df['scorey']=df['Survived']==df['영업상태코드']

In [190]:
df['scorey'].value_counts()

True     10303
False      461
Name: scorey, dtype: int64

In [191]:
print("제 점수는 : ",10303/10763*100)

제 점수는 :  95.72609867137415